In [1]:
import pandas as pd

In [2]:
# create a simple dataset of people
data = {
    'Name': ["John", "Anna", "Peter", "Linda"],
    'Location' : ["New York", "Paris", "Berlin", "London"],
    'Age' : [24, 13, 53, 33]
}

In [3]:
data = pd.DataFrame(data)
data

    Name  Location  Age
0   John  New York   24
1   Anna     Paris   13
2  Peter    Berlin   53
3  Linda    London   33

In [9]:
data[data.Age > 30]

    Name Location  Age
2  Peter   Berlin   53
3  Linda   London   33